TEXT_DICT = {
    'hi1': 'Привет! Очень рад, что дали мне шанс! Не терпится показать вам '
    'моё тестовое задание.',

    'hi2': 'С помощью кнопок, вы можете запросить мои фотографии и краткое '
    'эссе о моём увлечении',

    'hi3': 'Также боту можно написать текстом и попросить у него мои аудио '
    'ответы на вопросы про: GPT, разницу SQL и NoSQL, историю любви',

    'docs': 'Этого не может быть! Я же все проверил на 1000 раз перед сдачей:('
    '\nэх.. ладно, если это все-таки произошло, то просто отправьте:\n\n'
    '"GPT" - для получения войса о GPT\n"SQL" - для получения войса о разнице '
    'SQL и NoSQL\n"Любовь" - для получения войса об истории любви',

    'photo': 'Фотографию? Не вопрос!\nКакую вам отправить?',

    'back': 'Окей, никаких фотографий! Тогда что?',

    'what': 'К сожалению, не понял вас. Попробуйте перед записью немного '
    'подождать - 1 секундочку, у меня есть некоторые проблемы с пониманием '
    'первых слов - это особенность библиотек, которые я использую.\nСпасибо '
    'за понимание!',

    'repeat': 'Вот, что я услышал:\n«{}»',

    'essay': 'Моё главное увлечение на протяжении уже года - '
    '<b>программирование</b>!\n\nГод назад я вывел в консоль свой первый '
    '<code>Hello, World!</code>, и с тех пор всё никак не могу остановиться. '
    'Строчка за строчкой пополняется мой репозиторий, библиотека за '
    'библиотекой расширяется мой технологический стек.\n\nЗа время обучения я '
    'написал несколько интересных проектов:\n\n<i>- Корпоративный портал для '
    'сотрудников моего департамента\n- Социальная сеть для друзей\n'
    '- API-сервис для стандартизации адресов\n- Дэйли-бот для Telegram\n'
    '- Этот замечательный бот-портфолио</i>\n\nВ процессе обучения я понял, '
    'что профессия разработчика - это не только про написание кода, но и его '
    'отладку, оптимизацию, работу с кодом других программистов, '
    'версионирование кода, тестирование, а также деплой своих приложений и '
    'работа над их инфраструктурой на серверах.\n\n<i>Программирование - '
    'уникальный и безграничный мир, который открывает новые крутые '
    'возможности. Буду очень рад провести в этот мир таких же жаждущих знаний '
    'ребят!</i>'
}

STICKERS_DICT = {
    'hi': 'CAACAgIAAxkBAAEJpH5kqrk26qdTl0UWLDbeog8-RoAn2wACbwAD29t-AAGZW1Coe5O'
    'AdC8E',

    'error': 'CAACAgIAAxkBAAEJpIBkqru4GP4UMEIVHkNcU1A9-6lhRgACYwAD29t-AAGMnQU9'
    '50KD5y8E',

    'like': 'CAACAgIAAxkBAAEJpIJkqrvBHIxzZuOxRdTz0zIxNivyxQACPwAD29t-AAH05pw4A'
    'eSqaS8E',

    'thinks': 'CAACAgIAAxkBAAEJpIRkqrvQHG92ZAe9fIDUmhcLneAn_gACXwAD29t-AAGEsFS'
    'bEa7K4y8E',

    'kiss': 'CAACAgIAAxkBAAEJpIZkqrzAfNUTJvqhj5JfwKKvbcwMrAACZAAD29t-AAFfuVWO-'
    'HpEki8E',

    'cute': 'CAACAgIAAxkBAAEJpHxkqriX-JGw4-qgjK_FIgt0f0uLaAACbQAD29t-AAF1HuyF8'
    'vtEpS8E'
}

MSG_DICT = {
    'gpt': '(gt|gpt|гпт|чат|баб)',
    'sql': '(sql|бд|баз|данных|разниц)',
    'love': '(любов|любв|истор)'
}